In [1]:
c = 0.7
a= c*1082
b=c*299
print(a,b)

757.4 209.29999999999998

In [8]:
import psycopg2
conn = psycopg2.connect('host=localhost dbname=training user=postgres')
cur = conn.cursor()

In [83]:
x = 'Maths'

In [84]:
cur.execute(f"INSERT INTO subject(subject_name) VALUES('{x}')")

In [9]:
cur.execute('select * from subject')
all = cur.fetchall()
subjects_set = set()
for y in all:
    subjects_set.add(y[1])

[(1, 'Physics'),
 (4, 'Chemistry'),
 (5, 'Maths'),
 (6, 'Histroy'),
 (7, 'Maths'),
 (8, 'Maths'),
 (9, 'Chemistry'),
 (10, 'Maths'),
 (11, 'Chemistry'),
 (12, 'Drawing'),
 (13, 'Physical Education'),
 (14, 'Biology'),
 (15, 'Economics')]

In [14]:
subjects_set

{'Biology',
 'Chemistry',
 'Drawing',
 'Economics',
 'Histroy',
 'Maths',
 'Physical Education',
 'Physics'}

In [86]:
conn.commit()

# Making the connection

In [76]:
import psycopg2
import pandas as pd
conn = psycopg2.connect('host=localhost dbname=training user=postgres')
cur = conn.cursor()

# Subject

In [ ]:
# add unique constraint
# add the new cells in excel and write a try catch
# mark the cells done once it is updated

In [77]:
df = pd.read_excel('subject.xlsx')
df1 = df[df['status']!='Done']
for x in df1['subject_name']:
#     print('x')
    try:
        cur.execute(f"INSERT INTO subjects(subject_name) VALUES('{x}')")
        conn.commit()
    except:
#         print('hi',x)
        conn.commit()
        continue
    
df['status'] = 'Done'
df.to_excel('subject.xlsx',index=False)

x
x
x

In [70]:
df['status'] = 'Done1'
df.to_excel('subject.xlsx',index=False)

In [71]:
df

    subject_id        subject_name status
0          2.0               Maths  Done1
1          3.0           Chemistry  Done1
2          NaN             Drawing  Done1
3          NaN  Physical Education  Done1
4          NaN             Biology  Done1
5          NaN           Economics  Done1
6          NaN           Economics  Done1
7          NaN                  AI  Done1
8          NaN           Economics  Done1
9          NaN           Economics  Done1
10         NaN             Drawing  Done1
11         NaN               Craft  Done1

In [ ]:
df = pd.read_excel('subject.xlsx')
for x in df['subject_name']:
    if x not in subjects_set:
        cur.execute(f"INSERT INTO subject(subject_name) VALUES('{x}')")
        conn.commit()

In [30]:
# cur.execute('select * from subject')  
# all = cur.fetchall()
# subjects_set = set()
# for y in all:
#     subjects_set.add(y[1])

In [31]:
# df = pd.read_excel('subject.xlsx')
# for x in df['subject_name']:
#     if x not in subjects_set:
#         cur.execute(f"INSERT INTO subject(subject_name) VALUES('{x}')")
#         conn.commit()

# Batches

In [ ]:
df = pd.read_excel('batch.xlsx')
for x in df['batch_name']:
    cur.execute(f"INSERT INTO batch(batch_name) VALUES('{x}')")
    conn.commit()

# Day 5

In [1]:
import psycopg2
import pandas as pd
conn = psycopg2.connect('host=localhost dbname=training user=postgres')
cur = conn.cursor()

In [99]:
cur.execute(f"select subject_id from subjects where subject_name = 'Maths';")

In [100]:
x = cur.fetchone()

In [103]:
x[0]

12

In [13]:
df = pd.read_excel('teacher.ods')
df1 = df[df['status']!='Done']

In [7]:
df = pd.read_excel('teacher.ods')
df1 = df[df['status']!='Done']
for teacher,subject in df1[['teacher_name','subject_name']].values:
    print('x')
    cur.execute(f"select subject_id from subjects where subject_name = '{subject}';")
    
    try:
        sub_id = cur.fetchone()[0]
#         print(type(sub_id),sub_id)
#         print(sub_id,teacher)
        cur.execute(f"INSERT INTO teachers(subject_id,teacher_name) VALUES('{sub_id}','{teacher}');")
        conn.commit()
#         print('executed')
    except:
#         print('hi',x)
#         print('missed')
        conn.commit()
        continue
    
df['status'] = 'Done'
df.to_excel('teacher.ods',index=False)

x
x
x
x
x
x

In [23]:
# cur.execute(f"INSERT INTO teacher(subject_id,teacher_name) VALUES('{sub_id}','{teacher}');")
# conn.commit()

ForeignKeyViolation: insert or update on table "teacher" violates foreign key constraint "fk_subject_id"
DETAIL:  Key (subject_id)=(16) is not present in table "subject".

In [24]:
df['status'] = 'Not Done'
df.to_excel('teacher.ods',index=False)

In [3]:
for teacher,subject in df1[['teacher_name','subject_name']].values:
#     print('x')
    cur.execute(f"select subject_id from subjects where subject_name = '{subject}';")
    x = cur.fetchone()[0]
    print(x)

12
26
13
16

In [14]:
df1

  teacher_name subject_name  status
0        Arman        Maths     NaN
1       Neeraj           AI     NaN
2       Dhiraj    Chemistry     NaN
3         Mini      Biology     NaN

In [9]:
df['status']

0    Done
1    Done
2    Done
3    Done
Name: status, dtype: object

In [12]:
df = pd.read_excel('teacher.ods')

In [87]:
for x,y in df[['teacher_name','subject_name']].values:
    print(y)

Maths
Physics
Chemistry
Biology

In [84]:
 df[['teacher_name','subject_name']]

  teacher_name subject_name
0        Arman        Maths
1       Neeraj      Physics
2       Dhiraj    Chemistry
3         Mini      Biology

In [4]:
print('hi')

hi

# Day 7

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('availability_table.ods')

In [3]:
days = df.columns[1:]

In [4]:
import psycopg2
import pandas as pd
conn = psycopg2.connect('host=localhost dbname=training user=postgres')
cur = conn.cursor()
df = pd.read_excel('availability_table.ods')
days = df.columns[1:]

In [5]:
full_df = pd.read_excel('availability_table.ods')

# making dataframe out of the excel file
df = full_df[full_df['status']!='Done']
names = df['teacher_name'].values

for name in names:
    row = df[df['teacher_name']==f'{name}']
    for day in days:
        try:
            timings = row[f'{day}'].values[0]
            timings = [[int(x.split('-')[0]),int(x.split('-')[1])] for x in timings.split(',')]
            for start,end in timings:
                for i in range(start,end+1):
                    try:
                        cur.execute(f"INSERT INTO availability(teacher_name,day,slot) VALUES('{name}','{day}','{i}-{i+1}');")
                        conn.commit()
                        print('executed')
#                     print(f'{name} {day} {i}-{i+1}')
                    except:
                        conn.commit()
                        print('missed')
                        continue
                print()
        except:
            continue
full_df['status'] = 'Done'
full_df.to_excel('availability_table.ods',index=False)

executed
executed

executed
executed

executed
executed

executed
executed

executed
executed

executed
executed

executed
executed

executed
executed

In [29]:
df[df['teacher_name']==f'{names[0]}']

,teacher_name,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
0,Neeraj,"15-13,15-20","9-13,15-20","9-13,15-20","9-13,15-20","9-13,15-20","9-13,15-20",NaN

In [30]:
a = '9-13,15-20,45-48'

In [31]:
a= a.split(',')

In [32]:
a = [[int(x.split('-')[0]),int(x.split('-')[1])] for x in a]

In [33]:
for x,y in a:
    for i in range(x,y+1):
        print(f'{i}-{i+1}')
    print()

9-10
10-11
11-12
12-13
13-14

15-16
16-17
17-18
18-19
19-20
20-21

45-46
46-47
47-48
48-49

In [ ]:
"accept": "application/json",
"accept-encoding": "gzip, deflate, br",
"accept-language": "en-GB,en-US;q=0.9,en;q=0.8",
"origin": "https://www.demandstar.com",
"referer": "https://www.demandstar.com/",
"sec-fetch-dest": "empty",
"sec-fetch-mode": "cors",
"sec-fetch-site": "same-site",
"sec-gpc": "1",
"user-agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/100.0.4896.60 Safari/537.36",

# Day 11

In [53]:
list(dict_of_subjects.keys())

['Maths',
 'Chemistry',
 'Drawing',
 'Physical Education',
 'Biology',
 'Economics',
 'AI',
 'Craft',
 'Geography',
 'Civics']

In [1]:
import psycopg2
import pandas as pd
conn = psycopg2.connect('host=localhost dbname=training user=postgres')
cur = conn.cursor()

cur.execute('select subject_id,subject_name from subjects;')
list_of_subjects = cur.fetchall()
dict_of_subjects = dict()
for subject_id,subject_name in list_of_subjects:
    dict_of_subjects[subject_name]=subject_id

while True:
    subject_name = input(f'Select a subject from {list(dict_of_subjects.keys())} ').capitalize()
    if subject_name not in dict_of_subjects.keys():
        subject_name = input('Please insert a valid input from the list ').capitalize()
    else:
        break
    
subject_id = dict_of_subjects[subject_name]

cur.execute(f"select teacher_name from teachers where subject_id = '{subject_id}';")

teacher_name = cur.fetchall()

length = len(teacher_name)
df = pd.DataFrame(columns=['day','slot'])
if length ==1:
    cur.execute(f"select day,slot from availability where teacher_name = '{teacher_name[0][0]}'")
    df = pd.DataFrame(cur.fetchall(),columns=['day','slot'])
else:
    while length>=1:
        cur.execute(f"select day,slot from availability where teacher_name = '{teacher_name[length-1][0]}'")
        df = pd.concat([df,pd.DataFrame(cur.fetchall(),columns=['day','slot'])])
        length-=1
   
while True:      
    day = input(f"select from these days: {df['day'].unique()} ").capitalize()
    if day not in df['day'].unique():
        day = input('Please insert a valid day from the above list ').capitalize()
    else:
        break

slots = df[df['day']==day]['slot'].values

while True:      
    slot = input(f"Choose any one from {day}'s slots: {slots} ")
    if slot not in slots:
        slot = input('Please insert a valid slot from the above list ')
    else:
        break

cur.execute(f"select teacher_name from availability where day='{day}' and slot='{slot}'")
teacher = cur.fetchone()[0]

# for deleting the row from availability table
cur.execute(f"delete from availability where day = '{day}' and slot ='{slot}' and teacher_name='{teacher}';")

# for inserting the row to time_table
cur.execute(f"insert into time_table values('{subject_name}','{day}','{slot}')")
conn.commit()

Select a subject from ['Maths', 'Chemistry', 'Drawing', 'Physical Education', 'Biology', 'Economics', 'AI', 'Craft', 'Geography', 'Civics'] Maths
select from these days: ['Thursday'] Thursday
Choose any one from Thursday's slots: ['11-12' '12-13' '15-16' '16-17'] 12-13

In [2]:
df['day']

0    Friday
1    Friday
2    Friday
Name: day, dtype: object

In [ ]:
stop

In [43]:

# for x in teacher_name:
#     cur.execute(f"select day,slot from availability where teacher_name = '{x[0]}'")
#     df = pd.DataFrame(cur.fetchall(),columns=['day','slot'])

In [44]:
conn.commit()

In [3]:
import re

In [4]:
def splitText(text):
    text=re.findall('[A-Z][^A-Z]*',text)

    for i in range(1,len(text)):
        if text[i-1].isupper() and text[i].isupper():
            text[i]=text[i-1]+text[i]
            text[i-1]=''
    text=[x for x in text if len(x)>0] 
    return ' '.join(text)

In [11]:
splitText('JithinAukumaranKumar')

'Jithin Aukumaran Kumar'